# SQL I

Introducing SQL and databases.

## Starting Up SQL

Before we look at SQL syntax in detail, let's first get ourselves set up to run SQL queries in Jupyter.

#### Approach #1: SQL Magic

**1. Load the `sql` Module.** 

Load `%%sql` cell magic.

In [1]:
%load_ext sql

**2. Connect to a database.**  

Here, we connect to the SQLite database `basic_examples.db`.

In [7]:
%%sql
sqlite:///basic_examples.db

<br/>

**3. Run a simple SQL query.** 

Note the `%%sql` lets Jupyter parse the rest of the lines as a SQL command.

In [9]:
%%sql
SELECT * FROM Dragon;

 * sqlite:///basic_examples.db
Done.

[('hiccup', 2010, 10),
 ('drogon', 2011, -100),
 ('dragon 2', 2019, 0),
 ('puff', 2010, 100),
 ('smaug', 2011, None)]

**Simple query, this time on two different lines.**

In [11]:
%%sql
SELECT *
FROM Dragon;

 * sqlite:///basic_examples.db
Done.

[('hiccup', 2010, 10),
 ('drogon', 2011, -100),
 ('dragon 2', 2019, 0),
 ('puff', 2010, 100),
 ('smaug', 2011, None)]

#### Approach #2: `pd.read_sql`

It turns out that `pandas` has a special-purpose function to parse SQL queries. We can pass in a SQL query as a string to return a `pandas` DataFrame. To achieve the same result as we did using cell magic above, we can do the following.

**1. Connect to a database**

In [15]:
import sqlalchemy 
import pandas as pd

engine = sqlalchemy.create_engine("sqlite:///basic_examples.db")
connection = engine.connect()

**2. Run a simple SQL query**

In [17]:
query = """
SELECT * 
FROM Dragon;
"""

pd.read_sql(query, engine)

       name  year   cute
0    hiccup  2010   10.0
1    drogon  2011 -100.0
2  dragon 2  2019    0.0
3      puff  2010  100.0
4     smaug  2011    NaN

## Tables and Schema

A **database** contains a collection of SQL **tables**. Let's connect to our "toy" database `basic_examples.db` and explore the tables it stores.

In [19]:
%%sql
sqlite:///basic_examples.db

In [21]:
%%sql
SELECT * FROM sqlite_master WHERE type='table'

 * sqlite:///basic_examples.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 7, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'Dragon', 'Dragon', 2, 'CREATE TABLE Dragon (\n    name TEXT PRIMARY KEY,\n    year INTEGER CHECK (year >= 2000),\n    cute INTEGER\n)'),
 ('table', 'Dish', 'Dish', 4, 'CREATE TABLE Dish (\n    name TEXT PRIMARY KEY,\n    type TEXT,\n    cost INTEGER CHECK (cost >= 0)\n)'),
 ('table', 'Scene', 'Scene', 6, "CREATE TABLE Scene (\n    id INTEGER PRIMARY KEY AUTOINCREMENT,\n    biome TEXT NOT NULL,\n    city TEXT NOT NULL,\n    visitors INTEGER CHECK (visitors >= 0),\n    created_at DATETIME DEFAULT (DATETIME('now'))\n)")]

## Basic Queries

Every SQL query *must* contain a `SELECT` and `FROM` clause.

* `SELECT`: specify the column(s) to return in the output
* `FROM`: specify the database table from which to extract data

**Question:** Select all columns from the **Dragon** table.

In [39]:
%%sql
SELECT * FROM Dragon;

 * sqlite:///basic_examples.db
Done.

[('hiccup', 2010, 10),
 ('drogon', 2011, -100),
 ('dragon 2', 2019, 0),
 ('puff', 2010, 100),
 ('smaug', 2011, None)]

**Question:** Select columns **cute** and **year** from the **Dragon** table.

In [41]:
%%sql
SELECT cute, year FROM Dragon;

 * sqlite:///basic_examples.db
Done.

[(10, 2010), (-100, 2011), (0, 2019), (100, 2010), (None, 2011)]

**Aliasing** with `AS`

**Question:** Repeat the last exercise with aliasing.

In [43]:
%%sql
SELECT cute AS dragon_cuteness, year AS dragon_year FROM Dragon;

 * sqlite:///basic_examples.db
Done.

[(10, 2010), (-100, 2011), (0, 2019), (100, 2010), (None, 2011)]

**Uniqueness** with `DISTINCT`

**Question:** Select all the unique years in the **Dragon** table.

In [47]:
%%sql
SELECT DISTINCT year FROM Dragon;

 * sqlite:///basic_examples.db
Done.

[(2010,), (2011,), (2019,)]

**Filtering** with `WHERE`

**Question:** Select the **name** and **year** columns from the **Dragon** table such that the cute value is greater than 0.

In [49]:
%%sql
SELECT name, year
FROM Dragon
WHERE cute > 0;

 * sqlite:///basic_examples.db
Done.

[('hiccup', 2010), ('puff', 2010)]

**Question:** Select the **name**, **cute** and **year** columns from the **Dragon** table such that the cute value is greater than 0 or the year is greater than 2013.

In [53]:
%%sql
SELECT name, cute, year
FROM Dragon
WHERE cute > 0 OR year > 2013;

 * sqlite:///basic_examples.db
Done.

[('hiccup', 10, 2010), ('dragon 2', 0, 2019), ('puff', 100, 2010)]

**Question:** Select the **name** and **year** columns from the **Dragon** table such that the name is either 'puff' or 'hiccup'.

In [55]:
%%sql
SELECT name, year
FROM Dragon
WHERE name IN ('puff', 'hiccup');

 * sqlite:///basic_examples.db
Done.

[('hiccup', 2010), ('puff', 2010)]

**Question:** Get the name and cute value of all dragons whose cute value is not null.

In [57]:
%%sql
SELECT name, cute
FROM Dragon
WHERE cute IS NOT NULL;

 * sqlite:///basic_examples.db
Done.

[('hiccup', 10), ('drogon', -100), ('dragon 2', 0), ('puff', 100)]

**Ordering** data using `ORDER BY`

**Question:** Sort the **Dragon** table in descending order of cuteness.

In [59]:
%%sql
SELECT *
FROM Dragon
ORDER BY cute DESC;

 * sqlite:///basic_examples.db
Done.

[('puff', 2010, 100),
 ('hiccup', 2010, 10),
 ('dragon 2', 2019, 0),
 ('drogon', 2011, -100),
 ('smaug', 2011, None)]

**Restricting** output with `LIMIT` and `OFFSET`

**Question:** Query the first two rows of the **Dragon** table.

In [63]:
%%sql
SELECT *
FROM Dragon
LIMIT 2;

 * sqlite:///basic_examples.db
Done.

[('hiccup', 2010, 10), ('drogon', 2011, -100)]

**Question:** Query the two rows after the first row of the **Dragon** table.

In [65]:
%%sql
SELECT *
FROM Dragon
LIMIT 2 OFFSET 1;

 * sqlite:///basic_examples.db
Done.

[('drogon', 2011, -100), ('dragon 2', 2019, 0)]

## Grouping Data with `GROUP BY`

**Question:** Get all rows and columns of the **Dish** table.

In [67]:
%%sql
SELECT *
FROM Dish;

 * sqlite:///basic_examples.db
Done.

[('ravioli', 'entree', 10),
 ('ramen', 'entree', 13),
 ('taco', 'entree', 7),
 ('edamame', 'appetizer', 4),
 ('fries', 'appetizer', 4),
 ('potsticker', 'appetizer', 4),
 ('ice cream', 'dessert', 5)]

A small note: the fact that `type` is highlighted in green below is a consequence of Jupyter assuming that we are writing Python code (where `type` is a built-in keyword). `type` does *not* have a special meaning in SQL, so the color below does not indicate any special functionality. When we run the cell, Jupyter realizes it should recognize the code as SQL.

**Question:** Select the **type** column of the **Dish** table.

In [69]:
%%sql
SELECT type
FROM Dish;

 * sqlite:///basic_examples.db
Done.

[('entree',),
 ('entree',),
 ('entree',),
 ('appetizer',),
 ('appetizer',),
 ('appetizer',),
 ('dessert',)]

**Question:** Get all the dish types using GROUP BY.

In [71]:
%%sql
SELECT type
FROM Dish
GROUP BY type;

 * sqlite:///basic_examples.db
Done.

[('appetizer',), ('dessert',), ('entree',)]

**Question:** Query the total cost of each type of dish.

In [73]:
%%sql
SELECT type, SUM(cost) AS total_cost
FROM Dish
GROUP BY type;

 * sqlite:///basic_examples.db
Done.

[('appetizer', 12), ('dessert', 5), ('entree', 30)]

**Question:** Query the total cost, the minimum cost and the name of the most expensive dish of each type.

In [75]:
%%sql
WITH MaxCost AS (
    SELECT type, MAX(cost) AS max_cost
    FROM Dish
    GROUP BY type
)
SELECT d.type,
       SUM(d.cost) AS total_cost,
       MIN(d.cost) AS min_cost,
       d.name AS most_expensive_dish
FROM Dish d
JOIN MaxCost m
ON d.type = m.type AND d.cost = m.max_cost
GROUP BY d.type, d.name;

 * sqlite:///basic_examples.db
Done.

[('appetizer', 4, 4, 'edamame'),
 ('appetizer', 4, 4, 'fries'),
 ('appetizer', 4, 4, 'potsticker'),
 ('dessert', 5, 5, 'ice cream'),
 ('entree', 13, 13, 'ramen')]

**Question:** Count the number of rows in each year in the **Dragon** table.

In [77]:
%%sql
SELECT year, COUNT(*) AS row_count
FROM Dragon
GROUP BY year;

 * sqlite:///basic_examples.db
Done.

[(2010, 2), (2011, 2), (2019, 1)]

##

**Question:** Count the number of rows - including the rows with NULLs - in each year in the **Dragon** table.